IRP/src/Catalogs/PLSections/PLSections.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PLSections</name>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>SectionType</name>
  <type>
   <types>EnumRef.PLSectionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Order</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Expression</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>250</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SectionName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Accounts</name>
  <attributes>
   <name>Account</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>TurnoversType</name>
   <type>
    <types>EnumRef.AccountingAnalyticTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionNumber</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValue</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/PLSectionTypes/PLSectionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PLSectionTypes</name>
 <enumValues>
  <name>DataSelection</name>
 </enumValues>
 <enumValues>
  <name>Calculation</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/PLSections/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnReadAtServer(CurrentObject)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Object, ThisObject);
	EndIf;	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtClient
Procedure AccountsAccountOnChange(Item)
	CurrentData = Items.Accounts.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	CurrentData.ExtDimensionNumber = GetExtDimensionNumber(CurrentData.Account);
EndProcedure

&AtServer
Function GetExtDimensionNumber(Account)
	ExtDimNumber = 1;
	For Each ExtDimension In Account.ExtDimensionTypes Do
		If ExtDimension.ExtDimensionType.ValueType.Types()
			.Find(Type("CatalogRef.ExpenseAndRevenueTypes")) <> Undefined Then
				Return ExtDimNumber;
		EndIf;
		ExtDimNumber = ExtDimNumber + 1;
	EndDo;
EndFunction	

&AtClient
Procedure SectionTypeOnChange(Item)
	SetVisibilityAvailability(Object, ThisObject);
	If Object.SectionType = PredefinedValue("Enum.PLSectionTypes.Calculation") Then
		Object.Accounts.Clear();
	Else
		Object.Expression = "";
	EndIf;
EndProcedure

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Object, Form)
	IsDataSelectionType = (Object.SectionType = PredefinedValue("Enum.PLSectionTypes.DataSelection"));
	Form.Items.PageDataFilter.Visible = IsDataSelectionType;
	Form.Items.PageExpression.Visible = Not IsDataSelectionType;
EndProcedure
